# Cameron Holmes
## Week 13 3/12/2022
### Python - Pandas Series and DataFrame

In [1]:
import numpy as np

from pandas import Series, DataFrame
import pandas as pd

In [2]:
mydataset = {
    
    'cars': ["GMC", "Toyota", "Ford"],
    'seats': [8,7,5]
    
}

df1 = pd.DataFrame(mydataset)
print(df1)

     cars  seats
0     GMC      8
1  Toyota      7
2    Ford      5

In [3]:
type(df1)

pandas.core.frame.DataFrame

In [4]:
print(pd.__version__)

1.0.5

In [5]:
print(df1)

     cars  seats
0     GMC      8
1  Toyota      7
2    Ford      5

In [6]:
#Pandas Series
s = Series([2,5,7,-9,8,4])
s

0    2
1    5
2    7
3   -9
4    8
5    4
dtype: int64

In [7]:
print(s)

0    2
1    5
2    7
3   -9
4    8
5    4
dtype: int64

In [8]:
s.values

array([ 2,  5,  7, -9,  8,  4], dtype=int64)

In [9]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [10]:
s[1]

5

In [11]:
s[3]

-9

In [18]:
s[1] = 5

In [19]:
s[0] = 2

In [20]:
s

0     2
1     5
2     7
3    -9
4     8
5     4
dtype: object

In [22]:
#Create Labels
s = pd.Series( [-10,20,30,40], index=['w','x','y','z'])
s

w   -10
x    20
y    30
z    40
dtype: int64

In [24]:
s['y']

30

In [26]:
type(s)

pandas.core.series.Series

In [27]:
#creating series from numpy array
data = np.array(['a','b','c','d'])
s = Series(data, index=[100,101,102,103])
s

100    a
101    b
102    c
103    d
dtype: object

In [28]:
# values and index
summer_olympic = Series( [2520,1122,937,847,713],index=['USA','Russia','Germany','UK','France'] )
summer_olympic

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [29]:
summer_olympic['USA']

2520

In [30]:
summer_olympic[summer_olympic > 800]

USA        2520
Russia     1122
Germany     937
UK          847
dtype: int64

In [31]:
'USA' in summer_olympic

True

In [32]:
#Convert Series to dictionary
summer_olympic_dict = summer_olympic.to_dict()
summer_olympic_dict

{'USA': 2520, 'Russia': 1122, 'Germany': 937, 'UK': 847, 'France': 713}

In [33]:
summer_olympic_dict['UK']

847

In [34]:
#Convert dictionary to Series
summer_olympic_series = Series(summer_olympic_dict)
summer_olympic_series

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [35]:
countries = ['Russia','France','Spain','Germany','USA','UK','Italy']

In [36]:
#Redefine a Series
s2 = Series(summer_olympic_dict,index=countries)
s2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [38]:
pd.isnull(s2)

Russia     False
France     False
Spain       True
Germany    False
USA        False
UK         False
Italy       True
dtype: bool

In [39]:
pd.notnull(s2)

Russia      True
France      True
Spain      False
Germany     True
USA         True
UK          True
Italy      False
dtype: bool

In [40]:
summer_olympic_series +s2

France     1426.0
Germany    1874.0
Italy         NaN
Russia     2244.0
Spain         NaN
UK         1694.0
USA        5040.0
dtype: float64

In [41]:
s2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [42]:
s.name='Summer Olymic'

In [43]:
s

100    a
101    b
102    c
103    d
Name: Summer Olymic, dtype: object

In [44]:
s2.index.name='Countries'

In [45]:
s2

Countries
Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [51]:
# Creating a simple Pandas DataFrame
data = {
    "calories": [420,380,390],
    "fruits": ['Orange','Banana','Grape']
}

# load data into a DataFrame object:
df = DataFrame(data)
df

   calories  fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [53]:
d = df.loc[1]
d

calories       380
fruits      Banana
Name: 1, dtype: object

In [54]:
type(d)

pandas.core.series.Series

In [55]:
df.loc[[0,1]]

   calories  fruits
0       420  Orange
1       380  Banana

In [57]:
type(df)

pandas.core.frame.DataFrame

In [59]:
#DataFrame

data_dict = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
             'year': [2000,2001,2002,2001,2002,2003],
             'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}

df = pd.DataFrame(data_dict)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [60]:
df.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [62]:
df.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [63]:
# reorder the columns
DataFrame(data_dict, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [64]:
df2 = pd.DataFrame(data_dict, columns=['year','state','pop','debt'],
                  index=['one','two','three','four','five','six'])
df2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [65]:
df2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [66]:
df2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [67]:
df2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [68]:
df2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [69]:
df2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [70]:
df2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [72]:
df2['debt'] = np.arange(6.)
df2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [73]:
df2['debt'] = np.random.randn(6)
df2

       year   state  pop      debt
one    2000    Ohio  1.5  0.071179
two    2001    Ohio  1.7  0.050679
three  2002    Ohio  3.6  0.304395
four   2001  Nevada  2.4  1.459887
five   2002  Nevada  2.9 -0.031412
six    2003  Nevada  3.2  1.463165

In [74]:
#Assign a series of values to Pandas DataFrame
s3 = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])
s3

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [75]:
df2['debt'] = s3
df2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [76]:
#adding a new column
df2['eastern'] = df2['state'] == 'Ohio'

In [77]:
df2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [78]:
df2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [79]:
# delete column
del df2['eastern']
df2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [80]:
#using a nested dictionary to create a dataframe
pop_dict = {'Nevada': {2001: 2.4, 2002: 2.9},
           'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop_dict

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [81]:
df3 = DataFrame(pop_dict)
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [82]:
DataFrame(df3, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [83]:
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [84]:
df3['Ohio']

2001    1.7
2002    3.6
2000    1.5
Name: Ohio, dtype: float64

In [85]:
df3['Ohio'][:2]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [86]:
df3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [87]:
df3['Nevada'][:1]

2001    2.4
Name: Nevada, dtype: float64

In [88]:
df3.index.name = 'year'; df3.columns.name = 'states'
df3

states  Nevada  Ohio
year
2001       2.4   1.7
2002       2.9   3.6
2000       NaN   1.5